Revit 2027 API
SpecTypeId.Int.Integer Property
 Integer, in discipline Common.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId Integer { get; }
Public Shared ReadOnly Property Integer As ForgeTypeId
	Get
public:
static property ForgeTypeId^ Integer {
	ForgeTypeId^ get ();
}
static member Integer : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
SpecTypeId.Int Class
Autodesk.Revit.DB Namespace